# ================= Модули и пакеты =========
# Модуль - это просто файл с расширением .py, этим файлом можеть быть любой файл
# чтобы использовать модуль мы для начала пишем ключевое слово - import
# import <модуль> as <сокрощенное слово>
# ВСЕ ИМПОРТЫ МОДУЛЕЙ И ПАКЕТОВ ДЕЛАЕТСЯ В НАЧАЛЕ ФАЙЛОВ

#Пакет - это сборка файлов в папке, в пакете обьязательно должен присуствовать файл __init__.py

import math
print(math.sqrt(16))

# Создадим свой модуль
import test1

print(test1.sum_two_numbers(10, 15))