# ================= ООП ============
# обьектно орентированное программирование - подход (парадигма) к программированию, которые состоят из обьектов и их действий(методы)


""" 
класс - чертеж(шаблон) который описывает обьект(сущность)
атрибуты(обычные переменные) - данные о обьекте
методы(функции) - действие(возможности)


Обьект - Машина
----------
Атрибуты:
цвет
колеса
двери
мотор
--------
Методы:
ездить
тормозить
ломаться
"""
# def a_b() - snakecase
# StudentsHistory - camelcase

#Основные понятия
# класс - шаблон обьекта
# обьект - экземпляр класса
# атрибут - данные обьекта - переменные
# методы - действия - функция


class Student:
    def __init__(self, name, age): # Создание атрибутов(инициолизирование)
        # self- ссылка на обьект
        self.name = name # Атрибуты
        self.age = age
    
    def study(self): # Метод
        return f"{self.name} учится"

student1 = Student('Aktan', 20) # Создание обьекта 
student2 = Student('Almaz', 23)

print(student1.name)  
print(student1.study())  
print(student2.name)  


# Создать класс Dog - атрибуты name, breed
# метод sound() - гав гав!

class Dog:
    def __init__(self, name, breed):
        self.name = name
        self.breed = breed
        
    def sound(self):
        return 'Гав Гав!'
    
dog1 = Dog("Шарик", "дворняжка")
dog2 = Dog("Рекс", "овчарка")

print(dog1.name)
print(dog1.sound())


""" 
Атрибуты:
Атрибуты обьекта - то что есть у самого обьекта
Атрибуты класса - относится ко всему классу
"""

class Student:
    course_name = "Ai Academy" # Атрибут класса
    student_count = 0
    def __init__(self, name, age): # Создание атрибутов(инициолизирование)
        # self- ссылка на обьект
        self.name = name # Атрибуты обьекта
        self.age = age
        Student.student_count += 1 # Увеличииваем счетчик студентов
    
    def study(self): # Метод
        return f"{self.name} учится"
    
    def __str__(self): # Для отображения обьекта
        return f"{self.name} --- {self.age}"
    
student1 = Student('Aktan', 20)
student2 = Student('Almaz', 23)

print(student1.student_count)
print(student2.student_count)

# ============= Принципы ООП ========
# Наследование - родительский класс пердает дочернему классу все свои атрибуты и методы
# Инкапсуляция - 
# 1) все что относится к определенному классу находится внутри него
# 2) Уровни доступа: публичный, защищенный, приватный
# Полиморфизм - один метод может делать несколько вещей
# 5 + 4 = 9
# "5" + "4" = "54"
# Абстракция - класс пустышка
# Ассоциация: - связи
#1) Композиция
#2) Агрегация


